<?php
/**
 * ShopEx licence
 *
 * @copyright  Copyright (c) 2005-2012 ShopEx Technologies Inc. (http://www.shopex.cn)
 * @license  http://ecos.shopex.cn/ ShopEx License
 */

return array(
    /*
    |--------------------------------------------------------------------------
    | 跳过短信验证码
    |--------------------------------------------------------------------------
    |
    | 当开启调试模式, 短信验证码将不会发送短信，验证码均为123456
    | 只有在开启debug模式下才能生效
    |
    */
    'sms_vcode' => false,

    /*
    |--------------------------------------------------------------------------
    | 服务器验证
    |--------------------------------------------------------------------------
    |
    | 当开启调试模式, 每次请求都会验证服务器信息
    | 只有在开启debug模式下才能生效
    |
    */
    'license_check' => false,

    /*
    |--------------------------------------------------------------------------
    | 启用测试支付
    |--------------------------------------------------------------------------
    |
    | 启用测试支付，可以不花钱就完成支付
    | 只有在开启debug模式下才能生效
    |
    */
    'testpay' => false,

);


