<?php
/**
 * ShopEx licence
 *
 * @copyright  Copyright (c) 2005-2012 ShopEx Technologies Inc. (http://www.shopex.cn)
 * @license  http://ecos.shopex.cn/ ShopEx License
 */

return array(
    /*
    |--------------------------------------------------------------------------
    | Define All Of Luckymall Security Options
    |--------------------------------------------------------------------------
    |
    |  分组，理应每个top端口都有一个分组
    |
     */

    /*
    |--------------------------------------------------------------------------
    | Define Security Options For topapi
    |--------------------------------------------------------------------------
    |
     */
    'topapi' => [

        /*
        |--------------------------------------------------------------------------
        | Open 'fields' Params White List
        |--------------------------------------------------------------------------
        |
        | 在某些极度安全的场景下，启用对“fields”这个字段的白名单
        |
         */
        'fieldsWhiteList' =>false,
    ],

    /*
    |--------------------------------------------------------------------------
    | Define Security Options For Desktop
    |--------------------------------------------------------------------------
    |
     */
    'desktop' => [

        /*
        |--------------------------------------------------------------------------
        | Check All Requests Has XSS Script Does  For Desktop
        |--------------------------------------------------------------------------
        |
        | 在某些场景下，认为后台可以进行XSS注入。
        | 开启这个选项后，后台所有提交XSS将会拦截
        | 但是开启后，会导致很多功能无法使用，比如页面源码编辑
        |
        */
        'globalCheckXSSInject' => false,

        /*
        |--------------------------------------------------------------------------
        | Check All Request Has CSRF Attack
        |--------------------------------------------------------------------------
        |
        | 防范后台的CSRF脚本攻击
        | 这个只是用Referer进行判断
        |
        */
        'defenseCSRFByReferer' => true,

    ],

);
